<a href="https://colab.research.google.com/github/Pimmiiiu/DW/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#PANDAS

In [0]:
import pandas as pd

In [41]:
df = pd.read_csv("https://raw.githubusercontent.com/Pimmiiiu/DW/master/titanic_tab.txt",delimiter = "\t")
df

     Passenger Class  ... Survived
0              First  ...      Yes
1              First  ...      Yes
2              First  ...       No
3              First  ...       No
4              First  ...       No
...              ...  ...      ...
1304           Third  ...       No
1305           Third  ...       No
1306           Third  ...       No
1307           Third  ...       No
1308           Third  ...       No

[1309 rows x 12 columns]

In [42]:
df.columns

Index(['Passenger Class', 'Name', 'Sex', 'Age',
       'No of Siblings or Spouses on Board',
       'No of Parents or Children on Board', 'Ticket Number', 'Passenger Fare',
       'Cabin', 'Port of Embarkation', 'Life Boat', 'Survived'],
      dtype='object')

In [43]:
df['Passenger Class']

0       First
1       First
2       First
3       First
4       First
        ...
1304    Third
1305    Third
1306    Third
1307    Third
1308    Third
Name: Passenger Class, Length: 1309, dtype: object

In [44]:
df.iloc[2,0:5]

Passenger Class                                              First
Name                                  Allison, Miss. Helen Loraine
Sex                                                         Female
Age                                                              2
No of Siblings or Spouses on Board                               1
Name: 2, dtype: object

In [45]:
df.dtypes

Passenger Class                        object
Name                                   object
Sex                                    object
Age                                   float64
No of Siblings or Spouses on Board    float64
No of Parents or Children on Board    float64
Ticket Number                          object
Passenger Fare                        float64
Cabin                                  object
Port of Embarkation                    object
Life Boat                              object
Survived                               object
dtype: object

In [46]:
df['Age'].max()

80.0

In [47]:
df['Age'].min()

0.2

In [48]:
df[df['Age']==df['Age'].min()]

    Passenger Class                                     Name  ... Life Boat  Survived
763           Third  Dean, Miss. Elizabeth Gladys "Millvina"  ...        10       Yes

[1 rows x 12 columns]

In [49]:
df[df['Age']==df['Age'].max()]

   Passenger Class                                  Name  ... Life Boat  Survived
14           First  Barkworth, Mr. Algernon Henry Wilson  ...         B       Yes

[1 rows x 12 columns]

In [50]:
df.isnull().any()

Passenger Class                       False
Name                                  False
Sex                                   False
Age                                    True
No of Siblings or Spouses on Board    False
No of Parents or Children on Board    False
Ticket Number                         False
Passenger Fare                         True
Cabin                                  True
Port of Embarkation                    True
Life Boat                              True
Survived                              False
dtype: bool

In [88]:
df.isnull().sum(axis=0)

Passenger Class                          0
Name                                     0
Sex                                      0
Age                                    263
No of Siblings or Spouses on Board       0
No of Parents or Children on Board       0
Ticket Number                            0
Passenger Fare                           1
Cabin                                 1014
Port of Embarkation                      2
Life Boat                              823
Survived                                 0
dtype: int64

In [52]:
sum(df['Age'].isnull())

263

In [53]:
sum(df['Passenger Fare'].isnull())

1

In [54]:
sum(df['Cabin'].isnull())

1014

In [55]:
sum(df['Port of Embarkation'].isnull())

2

In [56]:
sum(df['Life Boat'].isnull())

823

In [0]:
df_clean = df.drop(['Name','Cabin','Life Boat','Age','Port of Embarkation','Ticket Number'],axis=1)

In [69]:
df_clean.isnull().sum(axis=0)

Passenger Class                       0
Sex                                   0
No of Siblings or Spouses on Board    0
No of Parents or Children on Board    0
Passenger Fare                        1
Survived                              0
dtype: int64

In [81]:
df_clean_row = df_clean.dropna(axis=0)
df_clean_row.isnull().sum(axis=0)

Passenger Class                       0
Sex                                   0
No of Siblings or Spouses on Board    0
No of Parents or Children on Board    0
Passenger Fare                        0
Survived                              0
dtype: int64

In [86]:
data_passenger, data_label = pd.factorize(df['Passenger Class'])
data_passenger, data_label
data_sex, data_label2 = pd.factorize(df['Sex'])
data_sex, data_label2
data_survived, data_label2 = pd.factorize(df['Survived'])
data_survived, data_label2

(array([0, 0, 1, ..., 1, 1, 1]), Index(['Yes', 'No'], dtype='object'))

In [83]:
df['Passenger Class'] = data_passenger
df['Passenger Class']

0       0
1       0
2       0
3       0
4       0
       ..
1304    2
1305    2
1306    2
1307    2
1308    2
Name: Passenger Class, Length: 1309, dtype: int64

In [84]:
df['Sex'] = data_sex
df['Sex']

0       0
1       1
2       0
3       1
4       0
       ..
1304    0
1305    0
1306    1
1307    1
1308    1
Name: Sex, Length: 1309, dtype: int64

In [89]:
df_clean_factorize = df_clean_row 
data_passenger, unused = pd.factorize(df_clean_row['Passenger Class'])
data_sex, unused = pd.factorize(df_clean_row['Sex'])
data_Survived, unused = pd.factorize(df_clean_row['Survived'])
df_clean_factorize['Passenger Class'] = data_passenger
df_clean_factorize['Sex'] = data_sex
df_clean_factorize['Survived'] = data_survived
df_clean_factorize.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

ValueError: ignored